{
  "Promises": ["비동기 연산의 최종 성공 또는 실패를 나타내며 결과값을 가지는 객체."],
  "Win32 API": ["윈도우 운영 체제에 대한 핵심 API로, C 언어를 사용하여 윈도우 애플리케이션 개발을 가능하게 함."],
  "Virtualenv": [
    "파이썬 애플리케이션의 의존성 관리를 위해 독립된 파이썬 환경을 생성하는 도구. 개발자가 프로젝트별로 격리된 파이썬 환경을 유지할 수 있게 함."
  ],
  "Event Loop": ["자바스크립트가 단일 스레드에서 비동기 작업을 처리하는 방식, 호출 스택, 이벤트 큐와 함께 작동함."],
  "Angular CLI": ["앵귤러 프로젝트의 생성, 관리, 빌드 및 배포를 도와주는 명령줄 인터페이스."],
  "Google Web Toolkit": [
    "개발자가 자바 언어를 사용하여 AJAX 애플리케이션을 개발할 수 있도록 해주는 프레임워크, 이후 자바스크립트로 컴파일 됨."
  ],
  "Spring Security": ["인증과 권한 부여를 위한 강력하고 맞춤화가 가능한 보안 프레임워크."],
  "Clone": [
    "GitHub에서 저장소의 복사본을 로컬 컴퓨터로 복제하는 행위. 개발자는 클론을 통해 로컬에서 작업 후 변경 사항을 원격 저장소에 업로드할 수 있음."
  ],
  "Boolean": ["참(true) 또는 거짓(false)의 두 가지 값만을 가질 수 있는 데이터 타입."],
  "Overloading": ["동일한 이름의 메소드를 다른 매개변수로 정의하는 것."],
  "C++11": [
    "C++의 표준 버전 중 하나로, 자동 형 변환, 범위 기반 루프, 스마트 포인터 등 현대적 프로그래밍 기능을 도입함."
  ],
  "SciPy": [
    "과학적 계산을 위한 파이썬 기반 생태계에서 넘파이에 기반한 오픈 소스 소프트웨어로, 수학, 과학, 공학을 위한 다양한 모듈을 제공함."
  ],
  "Abstract Class": ["하나 이상의 추상 메소드를 포함, 직접 인스턴스화 할 수 없음."],
  "Ferrite Core Memory": [
    "자성을 이용해 데이터를 저장하는 비휘발성 메모리. 1950년대와 1960년대에 컴퓨터 메인 메모리로 사용되었으며, 각 비트는 작은 자성 링으로 구성됨."
  ],
  "Knowledge Graph": ["연결된 데이터의 네트워크를 통해 사물 간의 관계와 속성을 표현하는 그래프 기반의 구조."],
  "Content Management System": ["웹사이트의 콘텐츠를 생성, 관리, 수정, 삭제할 수 있는 소프트웨어 시스템."],
  "Package": ["서로 관련된 여러 모듈들을 한데 묶은 컨테이너."],
  "Reactive System": ["데이터 변화에 자동으로 반응하여 DOM을 업데이트하는 Vue의 핵심 기능."],
  "Couchbase": ["문서 지향적 NoSQL 데이터베이스로, 모바일 애플리케이션에 최적화된 동기화, 검색, 인덱싱 기능을 제공함."],
  "GitHub Marketplace": [
    "개발 도구 및 애플리케이션을 찾고, 구매하며, GitHub 워크플로우에 통합할 수 있는 플랫폼. 다양한 개발 도구가 제공됨."
  ],
  "Software as a Service": [
    "소프트웨어와 관련 데이터가 중앙 호스트에 호스팅되고 클라우드를 통해 사용자에게 제공되는 소프트웨어 배포 모델."
  ],
  "Kanban": [
    "업무의 흐름을 시각화하여 생산성과 효율성을 높이는 애자일 방법론. 작업 상태를 '할 일', '진행 중', '완료' 등의 카테고리로 분류함."
  ],
  "Java 17": ["패턴 매칭, 레코드, 씰드 클래스 등을 도입하여 객체지향 모델을 강화한 또 다른 LTS 버전."],
  "Event-Driven Architecture": [
    "이벤트의 발생과 그에 따른 처리를 중심으로 시스템을 구축하는 소프트웨어 아키텍처 패턴."
  ],
  "Directives": ["DOM 요소의 모양, 동작 또는 레이아웃을 조정하는데 사용되는 클래스."],
  "Visual BASIC": [
    "마이크로소프트에 의해 개발된 BASIC 언어의 이벤트 구동형 버전으로, 사용자 인터페이스를 쉽게 개발할 수 있게 해줌."
  ],
  "useContext": ["컴포넌트 트리 안에서 동적인 컨텍스트를 공유할 수 있게 해주는 Hook."],
  "Pyramid": ["작은 웹 애플리케이션부터 대규모 복잡한 시스템에 이르기까지 확장성을 중시하는 웹 프레임워크."],
  "ECMAScript": ["자바스크립트의 표준 사양으로, 언어의 구문과 기본 객체를 정의함."],
  "Containerization Platform": ["애플리케이션을 컨테이너 내에 배치하여, 실행 환경으로부터 독립적으로 만드는 기술."],
  "pdb": [
    "파이썬 프로그램의 대화식 디버깅을 지원하는 모듈로, 프로그램의 실행을 일시 중지하고, 현재 상태를 검사하고 변경할 수 있음."
  ],
  "Condition": ["특정 코드가 실행될 때 검사되는 논리적 표현."],
  "unittest": ["테스트 케이스 작성, 테스트 조직화 및 테스트 실행을 위한 모듈로, 파이썬에 내장된 테스트 프레임워크."],
  "Amazon Kinesis": ["실시간 데이터 스트리밍을 캡처, 처리 및 분석하기 위한 AWS의 플랫폼."],
  "Qt Framework": ["크로스플랫폼 C++ 애플리케이션 프레임워크로, GUI 개발을 쉽게 하며 다양한 모듈을 제공함."],
  "Pages in Next.js": [
    "경로와 연결되는 React 컴포넌트로서, 파일 시스템 기반 라우팅을 통해 애플리케이션의 각 페이지를 정의함."
  ],
  "Templates": ["컴포넌트 뷰를 정의하는 HTML 마크업과 바인딩들을 결합한 레이아웃."],
  "Vue.js": ["사용자 인터페이스를 만들기 위한 점진적인 JavaScript 프레임워크."],
  "Commit": [
    "소스 코드나 파일의 변경 사항을 저장소에 기록하는 행위. 커밋에는 변경 내용, 작성자, 날짜와 같은 정보가 포함됨."
  ],
  "Vue Instance": ["모든 Vue 애플리케이션의 시작점으로, data, template, methods, lifecycle hooks 등의 옵션을 포함함."],
  "Virtual DOM": ["실제 DOM의 가벼운 복사본으로, React에서 UI의 변경 사항을 효율적으로 계산하기 위해 사용됨."],
  "Transformer-based Models": ["트랜스포머 아키텍처에 기반한 다양한 모델로, BERT, GPT-3 등이 포함됨."],
  "GitHub Pages": [
    "GitHub에서 제공하는 정적 웹사이트 호스팅 서비스. 개인, 프로젝트, 조직 페이지를 쉽게 호스팅할 수 있음."
  ],
  "Hibernate": [
    "자바 어플리케이션에서 관계형 데이터베이스를 사용하는 작업을 간소화하는 객체 관계 매핑(ORM) 라이브러리."
  ],
  "LevelDB": [
    "구글이 개발한 경량의 키-값 저장소로, 로컬 스토리지를 위한 데이터베이스로 사용되며 빠른 읽기 쓰기가 가능함."
  ],
  "Support Vector Machine": [
    "분류와 회귀 분석에 사용되는 지도 학습 모델로, 데이터 항목을 분리하는 최적의 경계를 찾음."
  ],
  "Gradient Boosting": [
    "약한 예측 모델을 순차적으로 개선해 나가는 방식으로, 주로 결정 트리에 기반한 강력한 학습 알고리즘."
  ],
  "Clang-Tidy": ["Clang 기반의 정적 코드 분석 및 리팩터링 도구로, 코드 품질 향상 및 코딩 스타일 향상을 지원함."],
  "useState": ["함수 컴포넌트에서 상태 관리를 가능하게 하는 Hook."],
  "Rust Standard Library": [
    "Rust 프로그래밍 언어와 함께 제공되는 표준 라이브러리로, 벡터, 문자열, 파일 입출력 등의 기본 기능을 제공함."
  ],
  "Wiki": [
    "GitHub 프로젝트에 대한 상세한 문서화를 제공하는 섹션. 프로젝트 관련 문서, 가이드라인, 사용 사례 등을 포함할 수 있음."
  ],
  "Syntax": ["프로그래밍 언어에서 코드를 작성하는 규칙."],
  "Flask-RESTful": [
    "Flask를 확장하여 REST API를 빌드하기 위한 추가 도구를 제공. Flask의 경량화 및 확장 가능한 특성을 유지하면서, 웹 서비스 개발을 간소화함."
  ],
  "Pull": [
    "원격 저장소의 변경 사항을 로컬 저장소에 가져오는 과정. 개발자는 이를 통해 다른 개발자의 최신 작업 내용을 로컬에 반영할 수 있음."
  ],
  "Java 8": ["람다 표현식과 스트림 API를 도입하여 함수형 프로그래밍을 지원하게 된 자바의 중요한 버전."],
  "Reactive Forms": ["폼의 입력을 비동기적으로 추적하고 유효성을 검사하는 반응형 프로그래밍 방식을 제공하는 API."],
  "Forge": ["마인크래프트 모드 개발을 위한 프레임워크로, 사용자가 자신만의 게임 경험을 만들 수 있게 해줌."],
  "Float": ["소수점이 있는 숫자. 부동 소수점 방식으로 저장."],
  "random": ["난수를 생성하는 함수를 포함하는 모듈로, 난수 생성, 시퀀스의 무작위 추출 및 순서 섞기 등에 사용됨."],
  "Scrum": ["애자일 개발 방식의 하나로, 짧은 주기의 스프린트를 통해 프로젝트를 관리하고 개발하는 프레임워크."],
  "Befunge": [
    "2차원 코드 레이아웃을 사용하는 언어로, 예를 들어, 'v@.﹤'는 코드의 방향을 바꾸고 종료하는 명령어의 시퀀스임."
  ],
  "Higher-Order Component": ["다른 컴포넌트를 받아 새 컴포넌트를 반환하는 함수."],
  "Multiple Inheritance": ["클래스가 둘 이상의 부모 클래스로부터 속성과 행동을 상속받을 수 있는 기능."],
  "Interpretation": ["스크립트 코드를 실시간으로 해석하고 실행하는 방식."],
  "Malbolge": [
    "특히 난해하게 설계된 언어로, 처음 프로그램을 작성하는 데 몇 년이 걸림. 프로그램은 종종 암호화된 문자열처럼 보임."
  ],
  "Structures (struct)": ["서로 다른 데이터 유형을 하나의 논리적 단위로 묶는 사용자 정의 데이터 타입."],
  "Pair Programming": [
    "두 명의 개발자가 하나의 워크스테이션에서 함께 코드를 작성하는 방법론. 효율성 증가와 오류 감소에 도움을 줌."
  ],
  "Vue Component": ["재사용 가능한 Vue 인스턴스로, 특정 부분의 사용자 인터페이스를 추상화하고 캡슐화함."],
  "Tauri": [
    "러스트 및 웹 기술을 사용하여 데스크톱 애플리케이션을 개발하는 프레임워크. 높은 보안성과 경량의 애플리케이션을 생성하는데 초점을 맞춤."
  ],
  "Destructor": ["객체 소멸시 자원을 해제하는 메소드."],
  "Spigot": ["마인크래프트 서버의 개발 및 확장을 위해 사용되는 오픈 소스 자바 라이브러리."],
  "Borrowing": [
    "Rust에서 변수를 소유하지 않고 다른 코드에 안전하게 빌려주는 메커니즘. 불변 대여와 가변 대여로 나뉘며, 소유권 규칙을 유지하면서 데이터 공유를 지원함."
  ],
  "Overriding": ["상속받은 메소드를 재정의하는 행위."],
  "Travis CI": ["GitHub 프로젝트를 위한 지속적 통합 서비스로, 테스트 및 배포를 자동화함."],
  "async/await": [
    "비동기 코드를 동기 코드처럼 보이고 동작하게 만드는 자바스크립트의 구문, Promises를 사용하여 구현됨."
  ],
  "Data Structure": ["데이터를 효율적으로 저장, 관리하고 접근하기 위한 구조."],
  "Incremental Static Regeneration": [
    "사용자가 페이지를 요청할 때마다 백그라운드에서 페이지를 재생성하여 업데이트를 반영하는 Next.js의 기능."
  ],
  "os": [
    "운영 체제와 상호작용하기 위한 다양한 기능을 제공하는 모듈로, 파일 시스템을 다루고 프로세스 관리 등을 가능하게 함."
  ],
  "Clustering": ["비슷한 특성을 가진 데이터 포인트들을 그룹화하는 비지도 학습 과정."],
  "Spring Framework": [
    "강력한 엔터프라이즈 어플리케이션을 만들기 위한 가장 인기 있는 자바 프레임워크 중 하나로, 의존성 주입과 관점지향 프로그래밍을 지원함."
  ],
  "Express.js": [
    "Node.js를 위한 최소화되고 유연한 웹 애플리케이션 프레임워크로, 웹 애플리케이션의 빠른 개발을 도와줌."
  ],
  "Vue CLI": ["Vue.js 프로젝트를 빠르게 구성하고 프로토타이핑하는 명령줄 인터페이스 도구."],
  "Sentiment Analysis": ["텍스트 데이터에서 사람의 의견, 감정, 태도를 분석하는 과정."],
  "C++17": [
    "구조화된 바인딩, if constexpr 문, 병렬 알고리즘 등을 포함한 표준 라이브러리와 언어 기능을 향상시킨 C++의 표준 버전."
  ],
  "Transformer": [
    "자연어 처리에서 주목받는 모델 아키텍처로, 병렬 처리와 attention 메커니즘을 통해 효율적인 학습 가능."
  ],
  "Celery": [
    "비동기 작업 큐를 처리하기 위한 오픈 소스 분산 시스템. 장기 실행 작업을 백그라운드에서 처리할 수 있도록 함으로써, 애플리케이션의 성능을 향상시킴."
  ],
  "Perceptron": [
    "인공 신경망의 초기 형태로, 간단한 분류 작업을 위한 선형 분류기로 사용됨. 인공 지능 연구의 초석을 다진 모델."
  ],
  "Dynamic Dispatch": [
    "Objective-C에서 메시지를 수신하는 객체가 메시지를 처리하는 방법을 동적으로 결정하는 메커니즘. 동적 디스패치를 통해 객체 간의 상호 작용을 유연하게 구현할 수 있음."
  ],
  "Cycle-Consistent Adversarial Networks": [
    "이미지-이미지 변환 작업에 사용되는 GAN의 한 종류로, 한 도메인의 이미지를 다른 도메인의 이미지로 변환."
  ],
  "Cassandra": ["고성능 분산 NoSQL 데이터베이스 시스템으로, 매우 큰 데이터셋에 대한 확장성과 가용성에 중점을 둠."],
  "getStaticProps": ["빌드 시 데이터를 가져와서 정적 생성을 할 때 사용하는 Next.js 함수."],
  "Java Enterprise Edition": [
    "대규모, 멀티티어 엔터프라이즈 애플리케이션을 구축하기 위한 자바 플랫폼. 일반 자바 SE 플랫폼에 웹 서버, 데이터베이스, 메시징 등의 기능이 추가됨."
  ],
  "Deep Learning": ["머신 러닝의 한 분야로, 신경망의 다층 구조를 사용하여 복잡한 패턴을 학습하는 방법."],
  "Cohesion": ["클래스/모듈 내 요소의 서로 연관되는 정도."],
  "Constructor": ["클래스로부터 객체를 생성할 때 호출되는 특별한 메서드."],
  "Brainfuck": [
    "메모리 조작 기반의 언어로, '+', '-', '﹤', '﹥', '[', ']', '.', ',' 8개의 명령어만 사용. 예를 들어, '+++' 코드는 메모리의 현재 셀 값을 3 증가시킴."
  ],
  "Visual Studio Code": [
    "마이크로소프트에서 개발한 소스 코드 편집기로, 다양한 프로그래밍 언어를 지원하며 확장 기능을 통해 IDE 기능을 추가할 수 있음."
  ],
  "Serde": [
    "Rust의 직렬화 및 역직렬화 라이브러리로, 데이터 형식을 직렬화하여 저장하고 다시 역직렬화하여 사용할 수 있음."
  ],
  "Ownership": [
    "Rust의 핵심 개념으로, 메모리 관리를 보장하기 위한 시스템. 모든 값에는 소유권이 있으며, 변수가 값을 소유하면 해당 값은 유효하며 메모리에서 안전하게 해제됨."
  ],
  "GPU": [
    "컴퓨터에서 그래픽스를 렌더링하는 데 특화된 프로세서. 초기에는 단순한 비디오 출력을 처리하는 데 사용되었으나, 현재는 복잡한 3D 그래픽스 및 병렬 처리 작업에도 중요한 역할을 함."
  ],
  "Codebase": [
    "소프트웨어 프로젝트의 전체 소스 코드 모음. 프로젝트의 기초를 형성하며, 팀원 모두가 작업하는 공통된 기반임."
  ],
  "Autoencoder": ["비지도 학습에서 사용되는 신경망 모델로, 입력 데이터의 압축된 표현을 학습."],
  "Markdown": [
    "텍스트를 포맷하는 데 사용되는 경량 마크업 언어. GitHub에서는 README 파일, 코멘트, 이슈 등에 널리 사용됨."
  ],
  "CircleCI": ["소프트웨어 팀이 빠르고 신뢰성 있게 소프트웨어를 빌드, 테스트, 배포할 수 있게 도와주는 CI/CD 도구."],
  "Rustfmt": ["Rust 코드 포맷터 도구로, 코드 스타일을 일관되게 유지하고 가독성을 높이는 데 사용됨."],
  "Kotlin/Native": [
    "LLVM을 사용하여 네이티브 바이너리로 컴파일할 수 있게 해주는 기술로, 여러 플랫폼에서 코틀린 코드를 실행할 수 있도록 함."
  ],
  "Jetpack Compose for Desktop": [
    "데스크톱 애플리케이션을 위한 모던 UI 툴킷으로, 선언적 방식으로 UI를 구축할 수 있게 함."
  ],
  "npm (Node Package Manager)": [
    "자바스크립트 프로그래밍 언어를 위한 패키지 관리자로, Node.js의 기본 패키지 관리자임."
  ],
  "Linting": [
    "소스 코드를 분석하여 프로그래밍 오류, 버그, 스타일 오류, 의심스러운 구문 등을 찾아내는 과정. 코드의 품질과 일관성을 높이는 데 사용됨."
  ],
  "Robotics": ["로봇을 설계, 제작, 운용하는 기술 분야로, 인공 지능과 기계공학의 교차점에 위치함."],
  "Continuous Deployment": [
    "개발된 소프트웨어를 자동으로 테스팅하고 프로덕션 환경으로 배포하는 과정. 지속적 통합(CI)과 연계됨."
  ],
  "Object Pascal": ["파스칼의 오브젝트 지향 버전으로, 소프트웨어 구성 요소의 모듈화와 재사용을 촉진함."],
  "Punch Cards": [
    "정보를 기록하는 데 사용된 종이 카드로, 특정 위치에 구멍을 뚫어 데이터를 나타냄. 19세기 중반에 최초로 도입되었고, 1970년대까지 컴퓨터 프로그램 및 데이터 입력의 주요 수단이었음."
  ],
  "VGGNet": [
    "이미지 인식을 위해 설계된 딥 컨볼루션 신경망으로, 깊은 아키텍처가 높은 인식 성능을 가져올 수 있음을 입증."
  ],
  "ALGOL 68": ["ALGOL의 후속 버전으로, 타입 정의와 구조체, 유니온, 포인터를 사용한 복잡한 데이터 구조를 지원함."],
  "Maven": ["프로젝트의 빌드, 의존성 관리 및 기타 작업을 자동화하는 소프트웨어 프로젝트 관리 도구."],
  "multiprocessing": [
    "병렬 처리를 위해 여러 프로세스의 생성과 관리를 가능하게 하는 모듈로, CPU 코어를 효과적으로 활용하여 실행 속도를 향상시킴."
  ],
  "TensorFlow": [
    "구글 브레인 팀에 의해 개발된 오픈 소스 머신 러닝 프레임워크. 데이터 플로우 그래프를 사용하여 복잡한 수치 계산을 수행하며, 딥 러닝 및 머신 러닝의 연구와 개발에 널리 사용됨."
  ],
  "React Router": ["싱글 페이지 애플리케이션에서 네비게이션을 구현하기 위한 라이브러리."],
  "Fork": [
    "GitHub에서 다른 사용자의 저장소를 자신의 계정으로 복사하는 것. 복사된 저장소는 원본과 독립적으로 수정이 가능함."
  ],
  "Code Review": [
    "다른 개발자가 작성한 코드를 검토하고 피드백을 제공하는 과정. 품질 향상, 버그 예방, 지식 공유에 도움이 됨."
  ],
  "Singleton Pattern": [
    "디자인 패턴의 하나로, 어떤 클래스의 인스턴스가 오직 하나만 생성되도록 보장하는 패턴. 이 인스턴스는 전역적으로 접근 가능하다."
  ],
  "Eclipse": ["자바를 포함한 여러 프로그래밍 언어를 지원하는 오픈 소스 IDE."],
  "Data Mining": ["대규모 데이터 세트에서 유용한 패턴, 관계, 이상치를 추출하는 과정."],
  "Yew": [
    "웹 어셈블리를 위한 러스트 프론트엔드 프레임워크. 리액트와 유사한 컴포넌트 기반 아키텍처를 제공하며, SPA(Single Page Application) 개발에 적합함."
  ],
  "GitLab": ["웹 기반의 Git 리포지토리 매니저로, 이슈 추적, 코드 리뷰, CI/CD 등을 제공함."],
  "subprocess": [
    "새 프로세스를 생성, 연결하고, 데이터를 파이프로 통신하고, 오류를 처리하고, 프로세스의 종료 코드를 얻기 위한 모듈."
  ],
  "Representational State Transfer": [
    "웹 서비스를 설계하는 데 사용되는 아키텍처 스타일로, 클라이언트-서버 통신에서 상태 정보를 표현하는 방식을 말함. RESTful 웹 서비스는 HTTP를 사용하여 데이터를 주고 받는다."
  ],
  "ArangoDB": ["다중 모델 데이터베이스로서, 문서, 그래프, 키-값 데이터 모델을 지원하며, 강력한 쿼리 언어를 제공함."],
  "Object Detection": ["이미지나 비디오 내에서 객체의 존재와 위치를 식별하는 컴퓨터 비전 기술."],
  "GNU Build System (Autotools)": ["소프트웨어 패키지를 구성하고 빌드하는 데 사용되는 스크립트 모음."],
  "GitHub Profile": [
    "GitHub 사용자의 개인 정보, 활동, 저장소, 기여 내역 등을 보여주는 페이지. 사용자는 자신의 경력, 관심사, 기술을 프로필을 통해 표현함."
  ],
  "Criterion.rs": [
    "러스트의 벤치마킹 도구. 성능 테스트 및 분석을 위해 사용되며, 정밀한 시간 측정과 통계 분석 기능을 제공함."
  ],
  "Anomaly Detection": ["데이터에서 비정상적인 패턴이나 이상 현상을 식별하는 과정."],
  "Bidirectional Encoder Representations from Transformers": [
    "자연어 처리에서 사용되는 전이 학습 방법론을 기반으로 한 모델로, 문맥에 따른 언어 이해에 강점을 가짐."
  ],
  "MongoDB": [
    "스키마가 없는 문서 지향적 NoSQL 데이터베이스로, JSON과 유사한 형식의 동적 문서를 사용하여 데이터를 저장함."
  ],
  "Polymorphism": ["동일 인터페이스에 대해 다른 동작을 정의할 수 있는 성질."],
  "Association": ["두 클래스 간의 관계, 객체들이 서로 연결됨."],
  "Change Detection": ["데이터 상태의 변경을 감지하고 DOM에 자동으로 반영하는 메커니즘."],
  "ARM Cortex": [
    "2005년 이후 ARM 아키텍처를 기반으로 하는 마이크로프로세서 코어의 가족. 특히 에너지 효율성이 높아 모바일 장치에서 주로 사용됨."
  ],
  "GLib": ["데이터 구조 조작, 시스템 추상화, 유틸리티 함수 등을 제공하는 저수준 시스템 라이브러리."],
  "FoundationDB": [
    "분산 데이터베이스 설계의 핵심 설계 원칙에 중점을 둔 멀티 모델 데이터 스토어로, ACID 트랜잭션을 지원함."
  ],
  "Composition": ["객체가 다른 객체의 생명주기를 관리하는 강한 집합 관계."],
  "Java Platform, Standard Edition": ["자바의 핵심 런타임 환경과 API를 제공하는 표준 플랫폼."],
  "Version Control System": ["파일 변화를 시간에 따라 기록하여 나중에 특정 버전을 참조할 수 있게 하는 시스템."],
  "Interface Builder": [
    "애플의 통합 개발 환경 (IDE) 중 하나로, 그래픽 사용자 인터페이스를 시각적으로 디자인하고 구성하는 데 사용됨. 주로 iOS 및 macOS 애플리케이션 개발에 활용됨."
  ],
  "logging": [
    "프로그램의 실행 동안 발생하는 이벤트를 추적하는 모듈로, 개발자가 오류, 정보, 경고 등 다양한 수준의 로그를 남길 수 있도록 함."
  ],
  "Vacuum Tubes": [
    "20세기 초반에 발명되어 초기 컴퓨터에서 스위칭 장치로 사용된 전자 부품. 트랜지스터에 의해 대체되기 전까지 전자 계산 기기의 주요 구성 요소였음."
  ],
  "Asynchronous JavaScript": [
    "이벤트 루프와 콜백을 사용하여 I/O 작업이나 코드 실행을 비동기적으로 처리하는 자바스크립트의 실행 모델."
  ],
  "Amazon Web Services": [
    "아마존이 제공하는 세계적으로 가장 광범위한 클라우드 플랫폼으로, 컴퓨트 파워, 데이터베이스 스토리지, 콘텐츠 전송 및 기타 기능을 제공함."
  ],
  "VueX Mutations": ["Vuex store의 상태를 동기적으로 변화시키는 메소드."],
  "Category": [
    "Objective-C에서 클래스의 확장을 가능하게 하는 메커니즘으로, 기존 클래스에 새로운 메소드나 속성을 추가할 수 있음. 카테고리를 사용하여 기능을 모듈화하고 재사용성을 높일 수 있음."
  ],
  "Elasticsearch": ["실시간 검색 및 분석을 위한 오픈 소스, 분산, RESTful 검색 엔진."],
  "React Native": ["React의 원리를 사용하여 iOS와 Android 앱을 개발할 수 있는 프레임워크."],
  "ARM Assembly": ["ARM 프로세서를 위한 어셈블리 언어로, 임베디드 시스템 및 모바일 애플리케이션에서 널리 사용됨."],
  "INTERCAL": ["의도적으로 복잡하게 만들어진 언어로, 예를 들어, 'DO ,1 ﹤- #4'는 변수 1에 숫자 4를 할당하는 명령어임."],
  "Random Forest": ["다수의 결정 트리를 결합하여 보다 강력한 모델을 만드는 앙상블 학습 방법."],
  "getInitialProps": [
    "초기 페이지 로드 시 데이터를 가져오는데 사용되며, 서버 사이드 렌더링과 정적 생성에 모두 사용할 수 있는 Next.js 함수. (현재는 getStaticProps와 getServerSideProps에 비해 사용이 줄어듦)"
  ],
  "LLVM (Low-Level Virtual Machine)": [
    "컴파일러 및 코드 최적화 도구를 개발하는 데 사용되는 프로젝트로, Clang의 기반이 되는 컴파일러 기술을 제공함."
  ],
  "Routing": ["애플리케이션 내에서 뷰를 전환하는 메커니즘, URL을 기반으로 작동함."],
  "Low-Level Debugger": [
    "디버깅 도구로, C, C++, Objective-C 및 Swift 언어를 지원하며, Clang과 함께 사용하여 코드 디버깅을 수행함."
  ],
  "Variable": ["값을 저장할 수 있는 메모리 공간에 붙여진 이름."],
  "Branch Protection Rules": [
    "GitHub에서 특정 브랜치에 대한 접근을 제어하고, 변경 사항의 병합을 관리하는 데 사용되는 설정. 코드의 안정성을 유지하기 위해 중요함."
  ],
  "Snapdragon": [
    "퀄컴에 의해 설계된 모바일 장치용 SoC(System on a Chip) 시리즈. 고성능 CPU 코어, GPU, 모뎀 등을 통합하여 스마트폰과 태블릿에 널리 사용됨."
  ],
  "JavaBeans": ["재사용 가능한 소프트웨어 컴포넌트를 만들기 위한 클래스 작성 규약."],
  "libclang": [
    "Clang의 C 라이브러리 인터페이스로, Clang 컴파일러 기능을 프로그래밍적으로 제어하고 분석할 수 있는 API를 제공함."
  ],
  "Property": [
    "Objective-C 및 Swift에서 사용되는 클래스 멤버로, 객체의 속성을 정의하고 접근자 및 설정자 메소드를 자동으로 생성하는데 사용됨. 프로퍼티를 통해 객체 상태를 캡슐화하고 데이터 캡슐화를 간편하게 구현할 수 있음."
  ],
  "Algorithm": ["문제를 해결하기 위한 단계적 절차나 방법."],
  "Vuex": ["Vue.js 애플리케이션의 상태 관리 패턴 및 라이브러리."],
  "Vue Directive": ["DOM 요소에 대한 특별한 행위를 정의하는 Vue의 특수 토큰."],
  "LOLCODE": [
    "인터넷 밈과 '롤캣'에서 영감을 받은 언어로, 예를 들어, 'HAI 1.2 CAN HAS STDIO? VISIBLE \"HAI WORLD!\" KTHXBYE'는 'Hello World!' 프로그램임."
  ],
  "Variational Autoencoder": ["오토인코더의 확장으로, 생성 모델링 작업에 사용되며 입력 데이터의 확률적 표현을 학습."],
  "Apache Struts": ["웹 어플리케이션 개발을 위한 MVC(Model-View-Controller) 프레임워크."],
  "TimescaleDB": [
    "시계열 데이터에 특화된 데이터베이스로, PostgreSQL을 기반으로 구축되어 PostgreSQL의 기능과 호환성을 제공함."
  ],
  "Framework": ["특정 목적을 위해 상호 작용하는 클래스와 인터페이스의 집합."],
  "Model-View-Controller": [
    "응용 프로그램을 세 부분, 즉 비즈니스 로직을 처리하는 모델, 사용자 인터페이스를 담당하는 뷰, 그리고 두 컴포넌트를 연결하는 컨트롤러로 구분하는 소프트웨어 디자인 패턴."
  ],
  "Django": [
    "파이썬으로 작성된 오픈 소스 웹 애플리케이션 프레임워크. 빠른 개발과 깔끔한 디자인을 장려하며, '배터리 포함(batteries included)' 철학을 따름으로써 필요한 대부분의 기능을 내장하고 있음."
  ],
  "Redis": ["인-메모리 데이터 구조 저장소로서, 데이터베이스, 캐시 및 메시지 브로커로 사용될 수 있음."],
  "heapq": ["리스트 기반의 최소 힙 정렬 알고리즘을 제공하는 모듈로, 우선순위 큐 기능을 구현하는데 사용됨."],
  "Object-Oriented Programming": ["객체의 상태와 행위를 중심으로 프로그램을 구성하는 방법론."],

  "Templates": ["자료형에 의존하지 않고, 함수나 클래스를 일반화하여 코드 재사용성을 높이는 기능."],
  "Java": ["객체지향적 특징을 갖추고, 한 번 작성하면 어디서나 실행될 수 있도록 설계된 범용 프로그래밍 언어."],
  "Reactive Programming": ["데이터 흐름과 변화 전파에 중점을 둔 비동기 프로그래밍 패러다임."],
  "threading": ["멀티스레딩 프로그래밍을 위한 모듈로, 동시에 여러 작업을 처리할 수 있게 하는 인터페이스를 제공함."],
  "argparse": [
    "커맨드 라인 옵션, 인자 및 서브-커맨드 파싱을 위한 모듈로, 사용자 친화적인 커맨드 라인 인터페이스를 생성하는데 도움을 줌."
  ],
  "Method": ["클래스 내에서 정의된 함수, 객체의 행동을 정의."],
  "Property": ["객체의 데이터에 접근하는 메소드를 통칭."],
  "Reinforcement Learning": [
    "에이전트가 보상을 최대화하는 방법을 학습하는 인공 지능의 한 분야, 주로 의사결정과 관련된 문제에 적용됨."
  ],
  "Gatsby": ["React를 기반으로 하는 오픈 소스 프레임워크로, 웹사이트와 앱을 빌드하기 위해 사용됨."],
  "ESLint": ["코딩 컨벤션을 강제하고, 오류를 예방하며, 일관된 코드 스타일을 유지하도록 돕는 자바스크립트 린팅 도구."],
  "Spring Data": [
    "데이터 접근 기술과 데이터 저장소에 대한 일관된, 봄-마이크로서비스 방식의 접근 방법을 제공하는 프레임워크."
  ],
  "Heroku": ["웹 애플리케이션 배포 모델로, 다양한 프로그래밍 언어를 지원하는 클라우드 기반 PaaS 제공자임."],
  "Parameter": ["함수나 메서드에 전달되는 변수."],
  "Firebase Realtime Database": [
    "구글의 클라우드 호스팅 NoSQL 데이터베이스로, 데이터를 실시간으로 동기화하여 앱 사용자 간의 협업을 가능하게 함."
  ],
  "Push": [
    "로컬 저장소의 변경 사항을 원격 저장소에 업로드하는 과정. 이를 통해 개발자는 자신의 작업 내용을 다른 팀원과 공유할 수 있음."
  ],
  "C Standard (C89/C90, C99, C11, C17)": [
    "C 언어의 여러 표준 버전으로, C89/C90은 ANSI와 ISO에 의해 첫 표준화된 버전, C99는 언어의 기능 확장을 포함, C11은 멀티쓰레딩 지원 추가, C17은 오류 수정과 명료화에 중점을 둠."
  ],
  "Transistor": [
    "반도체 기반 전자 스위칭 및 증폭 장치. 1947년 벨 연구소에서 발명되었으며, 크기, 신뢰성, 효율성에서 진공관을 능가하여 전자 산업을 혁신함."
  ],
  "Function": ["특정 작업을 수행하는 코드의 집합, 재사용 가능."],
  "Bukkit": [
    "마인크래프트 플러그인 개발을 위한 API를 제공하는 프레임워크. 스피곳의 전신으로, 커뮤니티 주도의 프로젝트임."
  ],
  "Argument": ["함수나 메서드 호출 시에 실제로 전달되는 값."],
  "Feature Extraction": ["원본 데이터에서 유용한 정보를 추출하여 문제 해결에 적합한 형태로 변환하는 과정."],
  "Unit Testing": [
    "소프트웨어의 가장 작은 단위인 '단위'를 독립적으로 검사하는 테스트 방법. 오류를 초기에 발견하고 수정하는 데 도움이 됨."
  ],
  "Magnetic Drum": [
    "1950년대에 데이터 저장 장치로 사용된 원통형의 자기 기억 장치. 이는 데이터와 프로그램을 저장하는 데 사용되었으며, 초기 컴퓨터 시스템에서 느린 액세스 시간의 주 기억 장치로 활용됨."
  ],
  "Machine Learning": [
    "인공 지능의 한 분야로, 데이터 분석을 통해 컴퓨터가 경험으로부터 학습하고 예측을 개선할 수 있도록 하는 알고리즘 및 기술."
  ],
  "Character": ["문자열을 구성하는 하나의 문자."],
  "Ansible": ["서버 구성, 애플리케이션 배포, 태스크 자동화 등을 위한 오픈 소스 도구."],
  "gc": [
    "가비지 컬렉션을 제어하기 위한 모듈로, 더 이상 사용되지 않는 메모리를 자동으로 회수하는 기능을 제공하며, 메모리 누수를 진단하는 데 도움을 줌."
  ],
  "Infrastructure as Code": [
    "인프라(서버, 네트워크, 가상 머신, 로드 밸런서 등)를 자동으로 관리 및 프로비저닝하기 위해 코드를 사용하는 프로세스."
  ],
  "Computed Properties": ["의존하는 반응형 데이터에 기반한 값을 계산하여 캐싱하는 Vue 인스턴스의 속성."],
  "Merge": [
    "두 개 이상의 브랜치를 하나로 통합하는 과정. 일반적으로 코드 변경 사항을 주 브랜치에 통합하기 위해 사용됨."
  ],
  "Motherboard": [
    "컴퓨터의 다양한 구성 요소를 연결하는 중심 회로 기판. CPU, 메모리, 입출력 포트 등이 부착되며, 컴퓨터의 기능 및 성능을 결정하는 핵심 부품임."
  ],
  "Data Binding": ["컴포넌트의 데이터와 템플릿의 HTML을 동기화하는 메커니즘."],
  "Chai": ["BDD / TDD 어설션 라이브러리로, Node.js와 브라우저를 위해 사용됨, 보통 Mocha와 함께 사용됨."],
  "Hooks": ["클래스 컴포넌트를 작성하지 않고도 상태 값과 여러 React의 기능을 사용할 수 있게 해주는 함수."],
  "AlexNet": ["딥 러닝에서 사용되는 대규모 컨볼루션 신경망 모델로, 이미지 인식 분야에서 혁신적인 성과를 보여주었음."],
  "UIKit": ["iOS 및 tvOS 애플리케이션 개발을 위한 UI 프레임워크로, Swift에서 iOS 앱을 구축하는데 사용됨."],
  "DynamoDB": [
    "AWS에서 제공하는 완전 관리형 NoSQL 데이터베이스 서비스로, 문서 및 키-값 저장 모델을 제공하며, 빠른 성능과 무한한 확장성을 가짐."
  ],
  "Build": ["소스 코드를 컴파일하고, 링크하고, 패키징하는 전체 과정. 실행 가능한 소프트웨어 제품을 생성함."],
  "Version Control": [
    "소스 코드의 변경 사항을 추적하고, 여러 버전 간의 차이를 관리하는 시스템. 협업과 변경 관리에 필수적임."
  ],
  "Convolutional Neural Network": [
    "이미지, 비디오 인식, 이미지 분류 등에 주로 사용되는 딥 러닝의 한 형태, 여러 계층을 통해 데이터의 특징을 추출하고 학습."
  ],
  "Webhook": [
    "GitHub 저장소의 특정 이벤트(예: 푸시, 풀 리퀘스트)가 발생했을 때 외부 서비스에 알림을 보내는 메커니즘. 자동화된 통합을 위해 사용됨."
  ],
  "Garbage Collection": ["프로그램이 할당했던 메모리 중 더 이상 사용하지 않는 부분을 자동으로 찾아서 해제하는 과정."],
  "Quarkus": [
    "컨테이너 우선 접근 방식으로, 서버리스, 클라우드, Kubernetes 환경에 적합한 자바 애플리케이션을 빌드할 수 있는 프레임워크."
  ],
  "Library": ["특정 기능을 수행하는 함수나 데이터의 집합."],
  "ResNet": ["깊은 신경망에서 발생할 수 있는 소실된 기울기 문제를 해결하기 위해 잔여 학습을 도입한 신경망 구조."],
  "Bayesian Networks": ["확률적 추론을 위해 변수 간의 조건부 의존성을 나타내는 그래픽 모델."],
  "C99": ["C 프로그래밍 언어의 또 다른 표준으로, 1999년에 채택되어 인라인 함수와 다양한 데이터 타입을 추가함."],
  "Simple and Fast Multimedia Library": [
    "C 및 C++로 개발된 멀티미디어 프로그래밍 라이브러리로, 2D 그래픽, 사운드, 네트워킹 등을 지원하여 게임 및 멀티미디어 애플리케이션을 개발하는 데 사용됨."
  ],
  "Rust": [
    "모질라가 개발한 시스템 프로그래밍 언어로, 메모리 안전성, 병행성, 고성능, 신뢰성을 강조하는 특징을 가짐. C 및 C++과 경쟁하며, 안전한 시스템 프로그래밍을 위한 도구로 사용됨."
  ],
  "Recursion": ["함수가 직접 또는 간접적으로 자신을 호출하는 프로세스."],
  "Return Value": ["함수나 메서드의 실행 결과로 돌려주는 값."],
  "Merge Conflict": [
    "여러 개발자가 동일한 코드의 다른 부분을 수정했을 때 발생하는 충돌. 해결을 위해 수동 개입이 필요함."
  ],
  "JavaScript": ["웹 페이지를 동적이고 대화식으로 만들기 위해 사용되는 고급 프로그래밍 언어."],
  "Restricted Boltzmann Machine": [
    "Boltzmann Machine의 단순화된 버전으로, 비지도 학습에 사용되며, 딥 러닝의 발전에 중요한 역할을 함."
  ],
  "Generative Adversarial Network": [
    "두 신경망이 서로 경쟁하면서 학습하는 구조로, 사실적인 이미지, 음성 등을 생성하는 데 사용됨."
  ],
  "Transfer Learning": [
    "한 분야에서 학습된 모델을 다른 분야의 유사한 문제에 적용하여 학습 시간을 단축하고 성능을 향상시키는 기법."
  ],
  "Babel": [
    "자바스크립트 컴파일러로, 최신 버전의 JavaScript 코드를 이전 버전으로 변환하여 브라우저 호환성을 향상시킴."
  ],
  "C Preprocessor": ["소스 코드가 컴파일되기 전에 실행되는 명령어 및 매크로를 처리하는 프로그램."],
  "Aggregation": ["객체가 다른 객체를 포함하는 관계, 단일체가 부분을 포함."],
  "SQLite": ["경량의 디스크 기반 데이터베이스로서, 외부 서버 프로세스가 필요 없이 SQL 데이터베이스 엔진을 제공함."],
  "Esoteric Programming Language": [
    "기존 프로그래밍 언어의 관습에서 벗어나, 실험적이거나 예술적, 때로는 유머러스한 목적으로 만들어진 언어."
  ],
  "Static Site Generation (SSG)": [
    "빌드 타임에 사이트를 렌더링하여 정적 파일을 생성하는 방법, Gatsby에서 사용되는 기술."
  ],
  "Vue Lifecycle Hooks": ["Vue 인스턴스가 생성, 업데이트, 파괴되는 과정에서 호출되는 사용자 정의 로직."],
  "Image Segmentation": ["이미지를 구성하는 여러 부분으로 나누어 각 부분이 무엇을 나타내는지 식별하는 과정."],
  "shelve": [
    "파이썬의 기본 데이터 객체를 지속적으로 저장하는데 사용되는 모듈로, 키-값 스토어의 형태로 데이터를 파일에 저장함."
  ],
  "Doxygen": [
    "C, C++, 및 다른 언어의 소스 코드 문서화 도구로, 코드 주석을 기반으로 문서를 생성하여 프로젝트 문서화를 간편하게 함."
  ],
  "Kotlin Multiplatform": ["단일 코드 베이스를 사용하여 여러 플랫폼에 걸쳐 애플리케이션을 개발할 수 있게 해주는 기능."],
  "NumPy": [
    "과학 계산을 위한 기본 패키지로, 다차원 배열 객체와 배열 작업을 위한 다양한 도구를 제공함. 성능을 위해 C 언어로 작성된 부분이 많아 연산 처리가 매우 빠름."
  ],
  "Props": ["컴포넌트로 전달되는 입력 값으로, 부모 컴포넌트로부터 받은 데이터."],
  "SwiftPM Manifest": ["스위프트 패키지를 정의하고 관리하기 위한 메타데이터 및 종속성 정보가 포함된 파일."],
  "Computer Vision": ["컴퓨터가 이미지 및 비디오에서 정보를 추출하고 이해하는 인공 지능 기술."],
  "Long Short-Term Memory": ["시퀀스 데이터를 처리하고 장기 의존성을 학습하는 데 효과적인 순환 신경망의 한 종류."],
  "Clang": [
    "LLVM 프로젝트의 일부로 개발된 C, C++, 그리고 Objective-C 컴파일러. Clang은 빠른 컴파일 속도와 정확한 오류 메시지로 유명하며, 다양한 플랫폼에서 사용됨."
  ],
  "collections": ["리스트, 딕셔너리, 튜플, 셋 외에 다양한 컨테이너 데이터 타입을 제공하는 모듈."],
  "Neural Network": ["인간 뇌의 작동 방식을 모방하여 패턴 인식 및 데이터 분류 작업을 수행하는 인공 지능의 기본 구조."],
  "Neo4j": ["그래프 데이터를 저장하기 위한 NoSQL 데이터베이스로, 노드 간의 관계를 효율적으로 저장하고 쿼리할 수 있음."],
  "Middleware": [
    "소프트웨어의 다른 부분 사이에서 데이터를 중계하거나 처리하는 소프트웨어 컴포넌트, Node.js의 Express.js에서 널리 사용됨."
  ],
  "SQLAlchemy": [
    "파이썬 SQL 툴킷 및 객체 관계 매핑(ORM) 라이브러리로, 데이터베이스와의 상호작용을 추상화하고 파이썬스러운 방식으로 데이터베이스를 조작할 수 있게 함."
  ],
  "Dimensionality Reduction": ["데이터의 특성을 줄여 계산 복잡성을 감소시키면서 중요한 정보를 유지하는 과정."],
  "Joomla": ["웹사이트와 온라인 애플리케이션을 구축하기 위한 강력하고 확장 가능한 CMS 플랫폼."],
  "Debugging": [
    "프로그램에서 버그나 오류를 찾아내고 수정하는 과정. 개발의 중요한 단계로, 소프트웨어의 안정성을 보장하는 데 중요함."
  ],
  "Encapsulation": ["데이터 구조와 데이터를 다루는 방법을 결합하여 외부로부터 숨김."],
  "Cloud Service": [
    "인터넷을 통해 제공되는 컴퓨팅 서비스의 모음으로, 서버, 스토리지, 데이터베이스, 네트워킹, 소프트웨어, 분석 및 인텔리전스 등이 포함됨."
  ],
  "Amazon Aurora": [
    "AWS에서 제공하는 MySQL 및 PostgreSQL과 호환되는 고성능 관계형 데이터베이스 서비스로, 높은 처리량과 복원력을 제공함."
  ],
  "Redux": ["애플리케이션의 상태 관리를 위한 예측 가능한 상태 컨테이너."],
  "datetime": [
    "날짜와 시간을 다루는 클래스를 제공하는 모듈로, 복잡한 날짜 계산과 시간 조작을 간단하게 처리할 수 있게 도와줌."
  ],
  "Link Component": ["넥스트 제이에스에서 라우터를 통한 클라이언트 사이드 페이지 전환을 가능하게 하는 React 컴포넌트."],
  "Objective-C": [
    "애플의 이전 언어로, Swift의 전신으로 사용되었으며, Cocoa 및 Cocoa Touch 프레임워크와 함께 사용됨. Objective-C는 객체 지향 및 동적 메시징을 지원하며, C 언어와 호환되는 특징을 갖고 있음. iOS 및 macOS 애플리케이션 개발에 사용되며, Objective-C로 작성된 코드와 Swift로 작성된 코드를 혼용하여 사용할 수 있음."
  ],
  "v-bind Directive": ["HTML 속성을 Vue 인스턴스의 데이터에 동적으로 바인딩하는 데 사용됨."],
  "Interface": ["다른 클래스가 구현해야 하는 메서드의 목록을 정의."],
  "Supervised Learning": ["레이블이 지정된 훈련 데이터를 사용하여 모델이 예측을 수행하도록 학습시키는 방법."],
  "JSX (JavaScript XML)": ["React 요소의 구조를 쉽게 작성할 수 있게 해주는 자바스크립트의 확장 문법."],
  "Recurrent Neural Network": ["시퀀스 데이터 처리에 적합한 신경망 구조로, 이전의 출력이 다음 입력의 일부로 사용됨."],
  "useEffect": ["함수 컴포넌트에서 부수 효과(side effects)를 수행할 수 있게 하는 Hook."],
  "Crossbeam": ["고성능 멀티스레딩을 위한 러스트 라이브러리. 동시성 프로그래밍에 필요한 데이터 구조와 도구를 제공함."],
  "Abstraction": ["핵심적인 개념이나 기능을 간략화하여 표현하는 과정."],
  "Bug Tracking": ["소프트웨어 개발 과정에서 발견된 오류나 결함을 기록, 추적, 해결하는 과정."],
  "AdaBoost": ["약한 학습기를 결합하여 강력한 학습기를 만드는 앙상블 학습 알고리즘."],
  "Integrated Development Environment": ["코드 작성, 디버깅, 실행을 지원하는 소프트웨어."],
  "Assembly Language": ["기계어 코드에 가깝지만 사람이 이해할 수 있는 기호와 명령어를 사용하는 저급 프로그래밍 언어."],
  "asyncio": [
    "비동기 프로그래밍을 위한 모듈로, 이벤트 루프를 사용하여 동시성을 처리하고, 비동기 I/O, 네트워크 연결, 웹 서버 등을 지원함."
  ],
  "Image Optimization": ["넥스트 제이에스에서 자동으로 이미지 크기 조정, 최적화 및 서빙을 수행하는 내장 기능."],
  "Pointer Arithmetic": [
    "메모리 주소를 직접 조작하는 연산으로, 포인터의 값에 정수를 더하거나 빼서 다른 주소를 가리키게 함."
  ],
  "Forking Workflow": [
    "소스 코드 공유와 변경에 대한 접근 방식 중 하나로, 각 개발자가 원본 저장소를 포크하여 자신의 변경 사항을 관리함."
  ],
  "Next.js": ["서버 사이드 렌더링 및 정적 웹 애플리케이션 생성을 위한 React 프레임워크."],
  "CMake": ["크로스 플랫폼 빌드 및 빌드 프로세스 관리 도구로, Clang과 함께 사용되어 C/C++ 프로젝트를 빌드 및 관리함."],
  "Jest": ["자바스크립트 테스트 프레임워크로, 특히 React 애플리케이션 테스팅에 사용됨."],
  "GitHub": [
    "소프트웨어 개발자들이 소스 코드를 저장하고 버전 관리를 할 수 있게 해주는 웹 기반의 호스팅 서비스로, Git 시스템을 사용함."
  ],
  "Components": ["앵귤러의 기본 빌딩 블록으로, HTML 요소와 데이터 바인딩을 통해 애플리케이션의 뷰를 제어함."],
  "socket": ["네트워크 통신을 위한 인터페이스를 제공하는 모듈로, TCP/UDP 연결을 통해 데이터를 송수신할 수 있음."],
  "Elman Network": [
    "순환 신경망의 한 형태로, 시간적 시퀀스 데이터 처리에 사용되며, 내부 상태를 통해 시퀀스 정보를 기억함."
  ],
  "Vaadin": [
    "서버 사이드 Java의 우수한 안정성과 웹의 풍부한 사용자 경험을 결합하여, 웹 어플리케이션을 구축할 수 있게 해주는 프레임워크."
  ],
  "Amethyst": ["Rust로 작성된 게임 엔진으로, 2D 및 3D 게임 개발에 사용되며 고성능과 확장성을 제공함."],
  "Whitespace": [
    "스페이스, 탭, 개행만을 명령어로 사용하는 언어로, 코드는 대부분의 텍스트 에디터에서 보이지 않는 공백으로 구성됨."
  ],
  "Delegates": [
    "Objective-C 및 Swift에서 사용되는 디자인 패턴으로, 객체 간 특정 이벤트 또는 동작을 처리하기 위한 콜백 메커니즘을 구현함. 주로 프로토콜을 준수하는 객체로 구현되며, 이벤트 발생 시 델리게이트 객체에 알림을 보내고 처리 로직을 호출함."
  ],
  "Compiler Optimization": ["컴파일러가 코드를 더 효율적으로 실행할 수 있도록 변환하는 과정."],
  "FORTRAN 77": ["표준화된 FORTRAN 언어의 버전으로, 1977년에 출시되어 배열 프로그래밍 및 다른 기능들을 도입함."],
  "You Only Look Once": ["실시간 객체 탐지를 위한 컴퓨터 비전 모델로, 빠르고 정확한 탐지 성능을 제공."],
  "Apache Camel": ["다양한 통신 시스템 간의 메시지 기반 미들웨어를 쉽게 통합할 수 있도록 돕는 경량 통합 프레임워크."],
  "Conditional Statement": ["주어진 조건에 따라 다른 코드 실행 경로를 결정."],
  "Single File Components": [
    ".vue 확장자를 가진 파일로, template, script, 그리고 optional style 태그를 포함하는 Vue 컴포넌트."
  ],
  "README File": [
    "프로젝트의 소개 및 안내를 담은 문서. GitHub 저장소의 루트에 위치하며 프로젝트에 대한 중요 정보를 제공함."
  ],
  "Codable": ["Swift의 프로토콜로, 데이터 모델을 JSON 또는 다른 형식으로 직렬화 및 역직렬화하는 데 사용됨."],
  "Deployment": [
    "개발된 소프트웨어를 사용자가 접근할 수 있는 환경에 설치하고 실행하는 과정. 제품을 최종 사용자에게 전달하는 단계임."
  ],
  "Hopfield Network": [
    "연상 기억을 모델링하기 위해 사용되는 완전히 연결된 재귀 신경망. 패턴 인식 및 분류 작업에 활용됨."
  ],
  "Tokio": ["Rust의 비동기 프로그래밍 라이브러리와 런타임으로, 네트워크 및 입출력 작업을 비동기로 처리하기 위한 도구."],
  "Python": [
    "가독성과 명료성에 중점을 둔 고급 프로그래밍 언어. 다양한 운영 체제에서 사용되며, 직관적인 문법과 동적 타이핑 기능을 갖추고 있어 초보자와 전문가 모두에게 인기가 높음."
  ],
  "Decision Tree": ["분류 및 회귀 문제에 사용되는 예측 모델링 방법으로, 데이터를 분할하는 일련의 질문을 통해 학습."],
  "Automatic Reference Counting": [
    "메모리 관리 기술로, 객체에 대한 참조 계수를 추적하고, 더 이상 참조되지 않을 때 메모리를 자동으로 해제함."
  ],
  "COBOL-85": ["1985년에 개정된 COBOL의 표준 버전으로, 구조적 프로그래밍 개념과 향상된 디버깅 기능을 제공함."],
  "Docker": ["애플리케이션을 컨테이너 내에서 빌드, 배포, 실행할 수 있도록 하는 오픈 소스 플랫폼."],
  "CherryPy": ["객체 지향 패러다임을 최소한의 노력으로 웹에서 구현할 수 있게 해주는 파이썬 웹 프레임워크."],
  "Fuzzy Logic": ["전통적인 이진 논리와 달리 부분적으로 참이거나 거짓일 수 있는 개념을 다루는 논리 시스템."],
  "Data Type": ["프로그래밍 언어에서 사용할 수 있는 데이터의 종류."],
  "Swift Package Manager": ["Swift 앱과 패키지의 의존성 관리 및 빌드를 자동화하는 도구."],
  "Artificial Intelligence": [
    "지능적인 행동을 모방하고, 학습 및 문제 해결을 수행할 수 있는 컴퓨터 시스템 또는 기계를 만드는 과학과 기술."
  ],
  "Integer": ["소수점이 없는 숫자."],
  "Internationalization": ["다국어 경로를 자동으로 생성하고 관리할 수 있는 넥스트 제이에스의 기능."],
  "Spring Cloud": [
    "클라우드 기반 마이크로서비스 어플리케이션을 쉽게 구축, 릴리즈 및 유지보수할 수 있도록 도와주는 프레임워크."
  ],
  "React": ["사용자 인터페이스를 구축하기 위한 선언적, 효율적이며 유연한 JavaScript 라이브러리."],
  "Diesel": [
    "Rust로 작성된 ORM (Object-Relational Mapping) 라이브러리로, 데이터베이스 연동을 쉽게 처리하고 데이터 모델을 다룸."
  ],
  "Hyper": ["Rust로 작성된 HTTP 클라이언트 및 서버 라이브러리로, 웹 애플리케이션 개발에 사용됨."],
  "Support Vector Network": ["서포트 벡터 머신의 초기 형태로, 분류 및 회귀 문제에 사용되는 지도 학습 모델."],
  "Backpropagation": [
    "신경망에서 사용되는 학습 알고리즘으로, 출력 오류를 네트워크를 거슬러 올라가며 전파하여 가중치를 조정함."
  ],
  "Java Virtual Machine": [
    "자바 바이트코드를 실행하는 추상 컴퓨터로, 자바 프로그램이 다양한 하드웨어 및 운영 체제에서 동작할 수 있게 함."
  ],
  "Socket Programming": ["네트워크 통신을 위해 소켓을 사용하여 데이터를 주고받는 프로그래밍 방법."],
  "Arrow": ["고급 함수형 프로그래밍 개념을 코틀린에 도입하는 라이브러리."],
  "Autonomous Vehicles": ["인공 지능, 센서, 컴퓨터 비전 기술을 사용하여 인간의 개입 없이 운행 가능한 차량."],
  "Modules": ["관련된 컴포넌트, 서비스, 디렉티브들을 묶어 기능을 구성하는 논리적 단위."],
  "pytest": [
    "파이썬을 위한 강력한 테스팅 프레임워크로, 간단한 단위 테스트에서 복잡한 기능 테스트에 이르기까지 지원함."
  ],
  "COBOL": ["비즈니스, 금융 및 행정 시스템을 위해 설계된 고급 프로그래밍 언어."],
  "RAII (Resource Acquisition Is Initialization)": [
    "객체의 수명을 통해 자원의 수명을 관리하는 프로그래밍 기법으로, 생성자에서 자원을 할당하고 소멸자에서 해제함."
  ],
  "Oracle Database": [
    "다목적 및 멀티모델 데이터베이스 관리 시스템으로, 대기업 환경에서 널리 사용되는 매우 범용적인 데이터베이스임."
  ],
  "Java Development Kit": [
    "자바 프로그램을 개발하기 위해 필요한 소프트웨어 개발 키트로, 컴파일러와 라이브러리 등을 포함함."
  ],
  "Decorator": ["클래스, 메서드, 프로퍼티 또는 파라미터에 메타데이터를 추가하기 위한 TypeScript의 특수한 종류의 선언."],
  "Service-Oriented Architecture": [
    "소프트웨어 컴포넌트를 재사용 가능한 서비스로 설계하여, 네트워크를 통해 서로 다른 시스템 간에 상호 작용할 수 있도록 하는 아키텍처 스타일."
  ],
  "JavaServer Faces (JSF)": ["UI 컴포넌트 기반의 웹 어플리케이션을 만들기 위한 자바 웹 프레임워크."],
  "Svelte": [
    "전통적인 프레임워크와 달리 빌드 시에 UI를 업데이트하는 데 필요한 최소한의 코드만을 생성하는 새로운 접근 방식의 컴파일러."
  ],
  "FORTRAN": ["과학적 및 공학적 계산을 위해 개발된 최초의 고급 프로그래밍 언어."],
  "C++20": ["코루틴 지원, 범위 지정 열거형, 개념 및 모듈 등을 도입하여 큰 변화를 제공한 C++의 최신 표준 버전."],
  "Message Passing": [
    "Objective-C에서 객체 간 상호 작용을 위해 사용되는 메커니즘. 메시지를 보내는 객체와 메시지를 수신하는 객체 간의 동작을 정의하며, 동적 메시지 전달을 지원함."
  ],
  "Mask R-CNN": ["Faster R-CNN에 기반하며, 객체 탐지 뿐만 아니라 픽셀 수준에서의 객체 분할도 수행하는 모델."],
  "Platform as a Service": ["클라우드 환경에서 애플리케이션 개발 및 실행에 필요한 플랫폼을 제공하는 서비스 모델."],
  "Database": [
    "조직화된 데이터의 컬렉션을 저장, 검색, 수정 및 관리하기 위한 시스템. 여러 유형과 모델이 있으며, 다양한 애플리케이션에 사용됨."
  ],
  "Ktor": ["코틀린으로 작성된 비동기 서버와 클라이언트 애플리케이션을 만들기 위한 프레임워크."],
  "CloudFormation": ["아마존 웹 서비스(AWS) 리소스를 모델링하고 설정하는 데 사용되는 서비스."],
  "Server-Side Rendering (SSR)": [
    "브라우저가 아닌 서버에서 웹 페이지를 렌더링하는 프로세스, Next.js에서 구현될 수 있음."
  ],
  "Mocha": ["유연한 자바스크립트 테스트 프레임워크로, 비동기 테스팅을 위해 설계됨."],
  "Integration Testing": [
    "개별 소프트웨어 모듈을 그룹화하여 공동으로 테스트하는 과정. 모듈 간의 인터페이스 오류를 찾는 데 유용함."
  ],
  "C++": ["객체지향 프로그래밍을 지원하는 C의 확장 언어로, 효율적인 추상화와 다중 패러다임 프로그래밍 기능을 제공함."],
  "Java 11": [
    "장기 지원(LTS) 버전으로, 새로운 HTTP 클라이언트, 로컬 변수 타입 추론(var), 에피션트한 가비지 컬렉션 등의 기능을 추가한 버전."
  ],
  "Git": ["분산 버전 관리 시스템으로서, 소프트웨어 개발에서 코드 변경을 효율적으로 추적할 수 있도록 해줌."],
  "Dependency Resolution": ["스위프트 패키지 관리자가 프로젝트의 종속성 패키지를 확인하고 가져오는 프로세스."],
  "Rustup": ["러스트 툴체인 인스톨러. 여러 버전의 러스트 컴파일러와 관련 툴을 관리하고 설치하는 데 사용됨."],
  "Data Streaming Platform": ["실시간 또는 레코드 단위로 데이터를 처리 및 분석하는 플랫폼."],
  "Natural Language Processing": ["컴퓨터가 인간의 언어를 이해하고 해석할 수 있도록 하는 인공 지능의 한 분야."],
  "Pip": ["파이썬 패키지 관리자로, 파이썬 패키지 인덱스(PyPI)에서 소프트웨어 패키지를 설치하고 관리하는 도구."],
  "Flux Architecture": [
    "클라이언트-사이드 웹 애플리케이션을 위한 구조적 패턴으로, 상태 관리와 데이터 흐름을 일방향으로 유지함."
  ],
  "Crates.io": ["Rust 패키지 레지스트리로, Rust 라이브러리 및 프로젝트를 공유하고 관리하는 데 사용됨."],
  "Rocket": ["Rust로 작성된 웹 프레임워크로, 빠르고 직관적인 웹 애플리케이션 개발을 위한 도구."],
  "Lifetime": [
    "Rust에서 참조의 유효 범위를 추적하는 시스템. 라이프타임 어노테이션을 사용하여 참조 수명을 명시하고 메모리 안전성을 보장함."
  ],
  "DB2": [
    "IBM에서 개발한 관계형 데이터베이스 관리 시스템으로, 큰 데이터 웨어하우스와 트랜잭션 처리 환경에서 널리 사용됨."
  ],
  "Tensor Processing Unit": [
    "구글이 개발한 특화된 AI 가속기로, 주로 TensorFlow와 같은 머신 러닝 프레임워크에서 사용됨. 효율적인 행렬 연산을 통해 머신 러닝의 추론과 학습 과정을 가속화함."
  ],
  "Boltzmann Machine": ["확률적인 신경망 모델로, 비지도 학습에 사용되며 복잡한 분포를 모델링할 수 있음."],
  "Swift Programming Language": [
    "애플이 개발한 멀티 패러다임 프로그래밍 언어로, iOS, macOS, watchOS, tvOS 애플 생태계에서 주로 사용됨."
  ],
  "Piet": [
    "이미지의 색상 변화를 통해 명령을 표현하는 언어로, 프로그램은 색상 블록의 패턴으로 구성되며, 예를 들어, 빨간색에서 노란색으로 변화는 '더하기' 연산을 의미함."
  ],
  "Runtime": ["프로그램이 실행되고 있는 동안의 환경 또는 시간."],
  "DevOps Tools": ["소프트웨어 개발(Dev)과 IT 운영(Ops)의 협력을 강화하기 위한 자동화 및 협업 도구."],
  "Vue Router": ["Vue.js 애플리케이션에 페이지 라우팅을 추가하는 공식 라이브러리."],
  "Lifecycle Methods": [
    "컴포넌트가 DOM에 삽입되기 전, 삽입된 후, 업데이트되기 전, 제거되기 전 등의 시점에 호출되는 메소드들."
  ],
  "Matplotlib": [
    "파이썬에서 2D 도표를 그리기 위한 라이브러리. 데이터 시각화에 필수적이며, 간편한 그래프 도구로 주로 사용됨."
  ],
  "Repository": [
    "프로젝트의 코드와 관련 문서를 저장하는 장소. GitHub에서는 각 프로젝트마다 하나 이상의 저장소를 가질 수 있음."
  ],
  "Access Modifier": ["클래스 및 멤버의 접근 범위를 지정하는 키워드."],
  "x86 Assembly": [
    "x86 마이크로프로세서를 위한 어셈블리 언어의 집합으로, 복잡한 기계어 명령어를 사용자 친화적인 코드로 변환함."
  ],
  "Closure": [
    "함수와 그 함수가 선언된 어휘적 환경의 조합으로, 외부 함수에서 선언된 변수를 내부 함수가 참조할 수 있음."
  ],
  "Actix": ["Rust로 작성된 경량 및 고성능 웹 애플리케이션 프레임워크로, 비동기 및 병렬 처리를 강조함."],
  "MySQL": [
    "오픈 소스의 관계형 데이터베이스 관리 시스템(RDBMS)으로, SQL (Structured Query Language)을 사용하여 데이터를 관리함."
  ],
  "Text Mining": ["텍스트 데이터에서 패턴, 트렌드, 관계를 추출하여 유용한 정보를 도출하는 과정."],
  "Terraform": ["클라우드 서비스, 인프라스트럭처 리소스를 구축, 변경 및 버전 관리하기 위한 IaC 도구."],
  "crates.io": [
    "러스트 프로그래밍 언어를 위한 공식 패키지 레지스트리. 다양한 라이브러리와 프로젝트(크레이트)를 호스팅하며, Cargo를 통해 접근 가능."
  ],

  "GitHub Actions": [
    "GitHub 내에서 직접 소프트웨어 워크플로우를 자동화할 수 있는 CI/CD 서비스. 빌드, 테스트, 배포 과정을 자동화하는 데 사용됨."
  ],
  "Optionals": ["값이 없을 수도 있는 변수 또는 상수로, 'nil' 값을 허용하는 데이터 타입."],
  "json": [
    "JSON 인코딩과 디코딩을 위한 모듈로, 파이썬 객체를 JSON 형식 문자열로 변환하거나, JSON 문자열을 파이썬 객체로 변환하는 기능을 제공함."
  ],
  "Principal Component Analysis": ["고차원 데이터의 차원을 축소하여 핵심적인 요소를 추출하는 통계적 방법."],
  "Boost Libraries": ["풍부한 라이브러리 집합으로, C++의 표준 라이브러리를 확장하며, 다양한 개발 요구사항을 지원함."],
  "Object": ["클래스 기반으로 생성된 인스턴스, 상태와 행동을 가짐."],
  "Pull Request": [
    "GitHub에서 소스 코드 변경 사항을 검토하고 논의하기 위해 생성되는 요청. 개발자는 이를 통해 코드 변경을 메인 프로젝트에 통합하려 함."
  ],
  "Zone.js": ["비동기 작업을 추적하고 변경 감지를 위한 훅을 제공하는 라이브러리."],
  "Sequence to Sequence": ["입력 시퀀스를 출력 시퀀스로 변환하는 모델로, 기계 번역, 텍스트 요약 등에 사용됨."],
  "Swift Package": ["Swift 코드, 리소스 및 종속성을 포함하는 패키지로, 다른 프로젝트에서 재사용 가능한 모듈을 정의함."],
  "VueX Actions": ["비동기 연산을 처리하고 상태를 변화시키는 Vuex store 내의 메소드."],
  "Google Cloud Platform": [
    "구글의 클라우드 컴퓨팅 서비스로, 호스팅과 컴퓨팅, 클라우드 스토리지 등 다양한 서비스를 포함함."
  ],
  "Self-Organizing Map": ["경쟁 학습을 통해 고차원 데이터를 저차원으로 시각화하는 데 사용되는 신경망 모델."],
  "Central Processing Unit": [
    "컴퓨터의 명령어를 해석하고 처리하는 핵심 하드웨어 컴포넌트. 최초의 상용 CPU는 1971년에 인텔이 출시한 4004였으며, 현재는 다중 코어 및 고속 처리 능력을 가진 첨단 CPU로 발전함."
  ],
  "Component": ["리액트에서 UI를 구성하는 독립적이고 재사용 가능한 부품."],
  "Recommender Systems": ["사용자의 취향과 행동을 분석하여 개인화된 제안을 제공하는 시스템."],
  "Messaging Platform": ["분산 시스템 내의 컴포넌트 간에 데이터를 교환하기 위해 사용되는 플랫폼."],
  "InfluxDB": ["시계열 데이터를 위해 최적화된 오픈 소스 데이터베이스로, 고속 읽기와 쓰기를 요구하는 환경에 적합함."],
  "Source Code": ["컴퓨터 프로그램을 구성하는 텍스트 코드."],
  "Generative Pre-trained Transformer": [
    "자연어 처리를 위한 딥 러닝 기반의 언어 생성 모델로, 다양한 언어 이해 및 생성 작업에 적용 가능."
  ],
  "Milestone": [
    "프로젝트의 중요 단계나 단기 목표를 나타내는 GitHub 기능. 이슈나 풀 리퀘스트를 마일스톤에 연결해 진행 상황을 추적할 수 있음."
  ],
  "POSIX Threads (pthreads)": ["C 언어를 위한 스레드 생성 및 제어를 위한 표준 API 세트."],
  "Object-Oriented Programming (OOP)": [
    "데이터를 객체로 추상화하고, 이를 통해 데이터와 함수를 하나의 단위로 묶어 관리하는 프로그래밍 패러다임."
  ],
  "Vulkan": [
    "3D 그래픽 및 컴퓨팅 API로, C 및 C++로 개발된 저수준 그래픽 라이브러리로, 고성능 그래픽 애플리케이션을 개발하는 데 사용됨."
  ],
  "Star": [
    "GitHub 사용자가 관심 있는 저장소를 북마크하는 기능. 스타를 통해 사용자는 쉽게 관심 있는 프로젝트를 추적할 수 있음."
  ],
  "Contributor": [
    "GitHub 프로젝트에 코드나 문서 등의 기여를 하는 개인. 프로젝트에 대한 풀 리퀘스트, 이슈 제기, 코드 수정 등을 수행할 수 있음."
  ],
  "FORTRAN 90": ["포트란 언어의 중요한 확장을 제공하는 1990년대 버전으로, 모듈화와 배열 연산 기능이 향상됨."],
  "API Routes": ["넥스트 제이에스에서 제공하는 서버리스 함수를 사용하여 API 엔드포인트를 생성하는 기능."],
  "RabbitMQ": ["경량 메시지 브로커로, 비동기 메시징을 지원함."],
  "Evolutionary Algorithms": ["자연 선택과 유전학 원리를 모방한 알고리즘으로, 최적화 문제를 해결하는 데 사용됨."],
  "Apache HBase": [
    "빅데이터와 실시간 읽기/쓰기 접근에 적합한, 비관계형 분산 데이터베이스로, Hadoop 에코시스템의 일부임."
  ],
  "Branching": [
    "소스 코드의 다른 버전을 관리하기 위해 원래 코드에서 분기하는 것. 기능 추가나 버그 수정 등을 독립적으로 작업하기 위해 사용됨."
  ],
  "Protocol": [
    "Objective-C 및 Swift에서 사용되는 디자인 패턴으로, 특정 동작을 수행하기 위한 메소드 및 속성의 목록을 정의함. 프로토콜을 준수하는 객체는 프로토콜에서 정의한 동작을 구현해야 함."
  ],
  "Array": ["동일한 타입의 여러 변수를 하나의 이름으로 관리하는 연속된 메모리 공간."],
  "Clang Format": ["Clang 기반의 코드 포맷팅 도구로, 코드 스타일을 일관되게 유지하고 가독성을 높이는 데 사용됨."],
  "Hotfix": [
    "배포된 소프트웨어의 긴급한 버그를 수정하기 위해 진행되는 빠른 소프트웨어 업데이트. 중요한 문제를 신속하게 해결하는 데 중점을 둠."
  ],
  "Standard Template Library (STL)": [
    "컨테이너, 반복자, 알고리즘, 그리고 함수 객체를 포함하는 C++ 표준 라이브러리의 일부분."
  ],
  "Async/Await": [
    "러스트에서 비동기 프로그래밍을 구현하기 위한 키워드. 'async'로 비동기 함수를 선언하고, 'await'로 비동기 작업의 완료를 기다림."
  ],
  "CockroachDB": [
    "고 가용성과 분산 처리를 지원하는 클라우드 네이티브 SQL 데이터베이스로, 일관성 있는 트랜잭션을 지원함."
  ],
  "Generative Pre-trained Transformer 3": [
    "자연어 처리에서 사용되는 대규모 언어 생성 모델로, 다양한 언어 작업을 수행할 수 있는 강력한 예측 능력을 가짐."
  ],
  "Kotlin": [
    "자바 가상 머신(JVM) 위에서 동작하며 자바 코드와 상호 운용이 가능한 정적 타입 프로그래밍 언어. 안드로이드 앱 개발에 자주 사용됨."
  ],
  "Webpack": ["자바스크립트 애플리케이션을 위한 정적 모듈 번들러로, 프로젝트의 많은 모듈을 번들로 묶어줌."],
  "Playground": ["실행 결과를 실시간으로 확인할 수 있는 Swift 코드 작성 및 실험 환경."],
  "Context API": ["컴포넌트 트리 전체에 걸쳐 데이터를 공유할 수 있는 방법을 제공하는 API."],
  "Cocoa Framework": [
    "Objective-C로 작성된 macOS 애플리케이션을 위한 소프트웨어 프레임워크. Cocoa는 AppKit 및 Foundation 프레임워크로 구성되며, 사용자 인터페이스 및 애플리케이션의 핵심 기능을 제공함."
  ],
  "Issue Tracking": [
    "소프트웨어 개발 프로젝트에서 발견된 버그나 기능 개선 요청 등을 관리하는 프로세스. GitHub 같은 플랫폼에서는 이슈 트래커를 제공함."
  ],
  "ALGOL 60": ["ALGOL 언어의 1960년 버전으로, 재귀와 조건부 실행과 같은 현대적 프로그래밍 개념을 도입함."],
  "Microservices": [
    "응용 프로그램을 작고, 독립적으로 배포 가능한 서비스의 모음으로 구축하는 아키텍처 접근 방식. 각 서비스는 특정 비즈니스 기능을 수행하며, 경량 프로토콜을 통해 서로 통신한다."
  ],
  "Pascal": ["가독성과 구조화에 중점을 둔 고급 프로그래밍 언어."],
  "v-model Directive": ["양방향 데이터 바인딩을 생성하여 form 입력과 앱 상태를 쉽게 연결함."],
  "Loop": ["코드의 일정 부분을 조건이 만족할 때까지 반복적으로 실행하는 구조."],
  "C++14": ["C++11을 개선하여 람다 함수 확장, 자동 타입 추론 개선, 컴파일 시간 상수 표현 등을 추가한 C++의 표준 버전."],
  "WordPress": ["오픈 소스 콘텐츠 관리 시스템으로, 주로 블로그 및 개인 웹사이트에 사용됨."],
  "Genetic Algorithms": ["자연 선택 과정을 모방한 최적화 알고리즘으로, 해결책의 '진화'를 통해 문제를 해결함."],
  "Refactoring": [
    "코드의 외부 동작을 변경하지 않으면서 내부 구조를 개선하는 과정. 코드의 가독성을 높이고 유지 보수를 용이하게 함."
  ],
  "Cargo": ["Rust 언어의 패키지 매니저 및 빌드 도구로, 종속성 관리와 라이브러리 개발을 지원함."],
  "Mio": [
    "저수준 비동기 I/O 프로그래밍을 위한 러스트 라이브러리. 고성능 이벤트 루프 및 비동기 네트워킹 기능을 제공함."
  ],
  "Microsoft SQL Server": [
    "관계형 데이터베이스 관리 시스템으로, 복잡한 데이터 분석 작업을 위한 강력한 통합 서비스를 제공함."
  ],
  "Predictive Analytics": ["역사적 데이터를 분석하여 미래의 사건을 예측하는 과정."],
  "State": [
    "컴포넌트의 상태를 저장하는 객체로, 컴포넌트에 대한 사용자의 상호작용이나 시간의 흐름에 따라 변경될 수 있음."
  ],
  "Class": ["객체를 생성하기 위한 틀로, 데이터와 함수를 하나로 묶음."],
  "ANSI C": ["C 언어의 표준 버전으로, 1989년에 미국 국가 표준 협회(ANSI)에 의해 표준화됨."],
  "Warp": ["러스트 기반의 마이크로 웹 프레임워크. 간결하고 빠른 웹 API 개발에 적합하며, 타입 안전한 라우팅을 제공함."],
  "Ahead-of-Time Compilation": ["애플리케이션을 브라우저가 실행하기 전에 컴파일하는 방식으로, 성능을 향상시킴."],
  "Grails": [
    "강력한 그루비 언어를 기반으로 하여, Java의 강점을 활용하고 Java EE 패턴을 단순화하는 것을 목표로 하는 웹 어플리케이션 프레임워크."
  ],
  "Salesforce": [
    "클라우드 기반의 고객 관계 관리(CRM) 서비스를 제공하며, 다양한 상업적 애플리케이션에 적용 가능한 SaaS 제품을 포함함."
  ],
  "Domain-Driven Design": [
    "복잡한 요구 사항을 반영하는 소프트웨어를 설계할 때, 도메인의 복잡성을 모델링하고 주요 초점을 맞추는 소프트웨어 설계 접근 방식."
  ],
  "Local Package": [
    "스위프트 패키지 매니페스트 파일을 포함한 로컬 디렉토리에 위치한 패키지로, 프로젝트에서 사용 가능함."
  ],
  "Cocoa Touch Framework": [
    "Objective-C로 작성된 iOS 애플리케이션을 위한 소프트웨어 프레임워크. Cocoa Touch는 UIKit 및 Foundation 프레임워크로 구성되며, iOS 기기에서 사용되는 애플리케이션 개발을 지원함."
  ],
  "Custom Server": [
    "넥스트 제이에스의 기본 서버 기능을 확장하거나 변경하기 위해 사용자 정의 서버 로직을 구현할 수 있는 기능."
  ],
  "Inheritance": ["한 클래스가 다른 클래스의 특성을 받아와 확장하는 기능."],
  "Flask": [
    "웹 애플리케이션을 구축하기 위한 경량 WSGI 웹 애플리케이션 프레임워크. 간단하고 확장 가능한 핵심 기능을 제공하며, 소규모 프로젝트에 적합하다고 평가받음."
  ],
  "OrientDB": [
    "멀티 모델 데이터베이스로, 그래프, 문서, 객체, 키/값 등 다양한 데이터 모델을 지원하는 NoSQL 데이터베이스임."
  ],
  "TypeScript": ["자바스크립트에 타입 시스템을 추가한 언어로, 대규모 애플리케이션 개발에 적합함."],
  "glob": [
    "파일 시스템 내에서 패턴 매칭을 사용해 파일 목록을 생성하는 모듈로, 와일드카드 패턴을 사용하여 파일 검색을 수행함."
  ],
  "LeNet-5": ["손글씨 숫자 인식을 위해 개발된 초기의 컨볼루션 신경망. 딥 러닝과 컴퓨터 비전 분야에 중요한 기여를 함."],
  "Riak KV": ["고 가용성, 분산 키-값 저장소로서, 고장 내성 및 수평적 확장성이 강점인 NoSQL 데이터베이스임."],
  "Continuous Integration": [
    "개발 중인 소프트웨어를 정기적으로 주 저장소에 통합하는 과정. 버그를 빠르게 발견하고 소프트웨어의 품질을 유지하는 데 도움을 줌."
  ],
  "Module": ["관련된 기능을 모아 놓은 파일 또는 소프트웨어 컴포넌트."],
  "GNU Compiler Collection (GCC)": [
    "C 언어를 포함한 다양한 프로그래밍 언어를 위한 컴파일러 모음으로, 소스 코드를 실행 가능한 바이너리로 변환함."
  ],
  "Application Programming Interface": [
    "소프트웨어 응용 프로그램이나 서비스가 서로 통신하는 데 사용하는 명세나 프로토콜. 개발자가 소프트웨어 컴포넌트를 쉽게 통합할 수 있도록 돕는다."
  ],
  "Compilation": ["고급 언어로 작성된 코드를 기계어로 변환하는 과정."],
  "IntelliJ IDEA": ["자바 개발을 위한 강력한 IDE로, 코드 보조, 자동 리팩토링, 버전 관리 통합 등의 기능을 제공함."],
  "MariaDB": ["MySQL에서 파생된 오픈 소스 관계형 데이터베이스로, 더 많은 스토리지 엔진과 기능을 제공함."],
  "itertools": ["반복 가능한 데이터 구조를 조작하기 위한 함수들을 제공하는 모듈로, 효율적인 루핑을 가능하게 함."],
  "GraphDB": [
    "그래프 이론을 바탕으로 설계된 데이터베이스로, 복잡한 연결성과 관계를 효율적으로 저장하고 쿼리하는데 사용됨."
  ],
  "Pipes": ["템플릿에서 데이터를 변환하고 표시하기 위한 방법을 제공하는 클래스."],
  "Speech Recognition": ["인공 지능이 사람의 말을 인식하고 이해하여 텍스트로 변환하는 기술."],
  "Spring Boot": [
    "스프링 기반 애플리케이션을 쉽게 만들고 실행할 수 있게 해주는 프레임워크로, 내장 서버를 사용하여 빠른 개발 및 배포를 가능하게 함."
  ],
  "GitHub Gist": [
    "코드 스니펫이나 간단한 파일을 공유하기 위한 서비스. 개발자는 Gist를 사용해 소량의 코드나 메모를 공유할 수 있음."
  ],
  "String": ["문자들의 집합."],
  "U-Net": ["의료 이미지 분할에 효과적인 신경망 구조로, 비교적 적은 데이터로도 높은 성능을 달성."],
  "PostgreSQL": [
    "강력한 오픈 소스 객체-관계형 데이터베이스 시스템으로, 안정성, 강력한 기능, 그리고 성능으로 잘 알려져 있음."
  ],
  "Fast R-CNN": ["R-CNN을 개선하여 더 빠른 학습과 탐지 속도를 제공하는 객체 탐지 모델."],
  "Chatbot": ["자연어 처리 기술을 사용하여 사용자와 대화를 나눌 수 있는 인공 지능 프로그램."],
  "Expert Systems": ["인간 전문가의 결정을 모방하여 특정 분야의 문제 해결에 사용되는 컴퓨터 시스템."],
  "Solr": ["아파치 루씬 기반의 고성능, 확장 가능한 검색 플랫폼."],
  "React Hooks": ["리액트 16.8에 도입된 기능으로, 클래스 없이 상태와 다른 리액트 기능을 사용할 수 있게 해줌."],
  "Services": ["로직을 재사용하기 위한 목적으로 다양한 컴포넌트에서 공유될 수 있는 비즈니스 로직을 포함하는 클래스."],
  "Bottle": [
    "마이크로 웹 프레임워크로써, 단일 파일로 구성되어 있어 작은 웹 애플리케이션을 신속하게 구축하기 위해 사용됨."
  ],
  "Node.js": ["서버 측 애플리케이션을 구축하기 위해 사용되는 자바스크립트 런타임 환경."],
  "Exception": ["프로그램 실행 중 비정상적 상황 발생을 처리하기 위한 객체나 상태."],
  "Dynamic Memory Allocation": [
    "프로그램 실행 중에 메모리를 할당하고 해제하는 과정으로, 'malloc', 'calloc', 'realloc', 'free' 함수를 통해 관리됨."
  ],
  "Apache Kafka": ["실시간 데이터 피드를 처리하기 위해 사용되는 분산 스트리밍 플랫폼."],
  "Rayon": ["데이터 병렬 처리를 위한 러스트 라이브러리. 쉽게 병렬 반복 및 기타 병렬 작업을 수행할 수 있도록 설계됨."],
  "Search Engine": ["데이터를 인덱싱하고 검색 쿼리를 빠르게 응답하는 시스템."],
  "math": ["수학적 연산을 위한 함수들을 제공하는 모듈로, 기본적인 수학 연산부터 복잡한 수학적 처리까지 가능하게 함."],
  "CouchDB": [
    "웹을 위해 최적화된 문서 지향 NoSQL 데이터베이스로, JSON으로 데이터를 저장하고 JavaScript를 사용하여 쿼리를 수행함."
  ],
  "POSIX API": [
    "포터블 운영 체제 인터페이스로, C 언어를 이용한 표준 운영 체제 인터페이스를 정의하여 프로그램의 이식성을 높임."
  ],
  "Continuous Integration/Continuous Deployment": [
    "개발 과정에서 소프트웨어의 새로운 코드 변경사항이 자동으로 빌드 및 테스트되어 메인 저장소에 병합되고, 안정적으로 배포되는 프로세스."
  ],
  "Django REST framework": [
    "장고 웹 프레임워크를 위한 강력한 그리고 유연한 툴킷으로, API의 빠르고, 간결하며 확장 가능한 구축을 지원함."
  ],
  "Regions with Convolutional Neural Network": [
    "객체 탐지와 관련된 이미지의 특정 부분을 식별하는 데 사용되는 신경망 모델."
  ],
  "Dependency Injection": ["컴포넌트에 필요한 서비스나 객체를 자동으로 제공하는 디자인 패턴."],
  "re": ["정규 표현식을 지원하는 모듈로, 문자열에서 패턴 매칭, 검색, 치환 등 복잡한 문자 처리를 가능하게 함."],
  "getServerSideProps": ["각 요청마다 페이지를 서버에서 렌더링 할 때 필요한 데이터를 가져오는 Next.js 함수."],
  "Clang Static Analyzer": ["소스 코드 정적 분석 도구로, C 및 C++ 코드에서 잠재적인 오류와 취약점을 검출하고 보고함."],
  "Block": [
    "Objective-C 및 Swift에서 사용되는 익명 함수 또는 코드 블록으로, 변수와 함수처럼 다룰 수 있는 객체. 주로 비동기 작업, 콜백 처리, 코드 재사용 등에 활용됨."
  ],
  "Kubernetes": ["컨테이너화된 애플리케이션의 배포, 확장 및 운영을 자동화하는 오픈 소스 시스템."],
  "ALGOL": ["과학적 계산에 사용되었던 절차적 프로그래밍 언어로, 많은 후속 언어들에 영향을 미침."],
  "Unsupervised Learning": ["레이블이 없는 데이터로부터 패턴을 찾아내는 머신 러닝 방법."],
  "Jupyter": [
    "라이브 코드, 방정식, 시각화 및 설명 텍스트를 포함한 문서를 만들고 공유할 수 있는 오픈 소스 웹 애플리케이션. 데이터 정리, 통계 모델링, 머신 러닝 등의 작업을 위한 훌륭한 도구로 사용됨."
  ],
  "BASIC": ["초보자를 위한 상징적인 지시 코드(약자), 프로그래밍 교육을 목적으로 쉽게 배울 수 있는 언어."],
  "Pandas": [
    "데이터 분석과 조작을 위해 사용되는 라이브러리로, 특히 숫자 테이블과 시계열을 조작하기 위한 데이터 구조와 연산을 제공함."
  ],
  "Bitbucket": [
    "소스 코드와 개발 프로젝트를 관리할 수 있는 웹 기반 버전 관리 리포지토리 서비스로, Atlassian에 의해 제공됨."
  ],
  "functools": [
    "고차 함수를 조작하기 위한 함수들을 제공하는 모듈로, 함수를 인자로 받거나 결과로 반환하는 함수 작업을 돕는다."
  ],
  "Semantic Analysis": ["언어의 의미를 분석하는 과정, 자연어 처리에서 중요한 역할을 함."],
  "Test-Driven Development": [
    "소프트웨어 개발 프로세스에서 테스트 케이스를 먼저 작성하고, 이 테스트를 통과하는 코드를 개발하는 방식. 코드의 품질과 유지 보수성을 향상시키는 데 목적이 있다."
  ],
  "Agile Software Development": [
    "소프트웨어 개발에서 유연하고 반응성이 높은 접근 방식. 이는 짧은 개발 주기와 지속적인 고객 피드백을 통해 프로젝트를 진행함."
  ],
  "Exception Handling": [
    "프로그램 실행 중 발생할 수 있는 예외 상황을 관리하고, 안정적인 프로그램 실행을 유지하는 기법."
  ],
  "Rollback": [
    "소프트웨어를 이전 버전으로 되돌리는 과정. 일반적으로 문제가 발생했을 때 안정성을 확보하기 위해 사용됨."
  ],
  "RethinkDB": ["실시간 웹 애플리케이션을 위해 설계된 오픈 소스 분산 문서 지향 데이터베이스임."],
  "Dynamic Routing": ["파일과 폴더 이름을 사용하여 동적 경로 매개변수를 정의하는 Next.js의 라우팅 방식."],
  "Faster R-CNN": ["Fast R-CNN의 속도와 정확도를 더욱 향상시킨 객체 탐지 모델."],
  "Jenkins": ["지속적 통합(CI) 및 지속적 전달(CD)를 위한 오픈 소스 자동화 서버."],
  "C": ["일반적으로 사용되는 범용, 고급 프로그래밍 언어로, 운영 체제 및 시스템 소프트웨어 개발에 중요함."],
  "Branch": [
    "버전 관리 시스템에서 주 개발 라인에서 분기하여 독립적인 작업을 수행할 수 있는 코드의 복사본. 프로젝트에서 여러 기능을 동시에 개발하는데 유용함."
  ],
  "Angular": ["웹 애플리케이션을 만들기 위한 플랫폼 및 프레임워크로, TypeScript를 기반으로 함."],
  "hashlib": ["암호화 해시 함수를 제공하는 모듈로, 데이터의 무결성을 검사하고 안전한 방식으로 저장하는데 사용됨."],
  "OpenGL": ["2D 및 3D 그래픽 라이브러리로, C 및 C++로 개발된 그래픽 애플리케이션을 위한 표준 인터페이스를 제공함."],
  "Play Framework": ["웹 어플리케이션을 빠르고 쉽게 개발할 수 있게 해주는 고성능, 확장성 있는 웹 프레임워크."],
  "sys": [
    "파이썬 인터프리터와 관련된 변수와 함수에 접근할 수 있는 모듈로, 명령줄 인수, 입출력 관리, 임포트 관련 설정 등을 다룸."
  ]
}
